cask "ghostty"
brew "neovim"
brew "tmux"
brew "oh-my-posh"
brew "lazygit"
brew "uv"
brew "node"
brew "pnpm"
brew "libpq"
cask "visual-studio-code"
cask "font-jetbrains-mono-nerd-font"
cask "microsoft-edge"
cask "microsoft-teams"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-outlook"
cask "messenger"
cask "spotify"
