# Essentials
cask "ghostty"
brew "tmux"
brew "lazygit"
cask "fork"
brew "oh-my-posh"
brew "jq"

# Development tools
brew "uv"
brew "node"
brew "pnpm"

# Development dependencies
brew "libpq"
brew "ripgrep"
cask "docker-desktop"

brew "azure-cli"

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

# Code editors
brew "neovim"
cask "visual-studio-code"

# Misc
cask "font-jetbrains-mono-nerd-font"
cask "keepingyouawake"

# Desktop applications
cask "microsoft-edge"
cask "microsoft-teams"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-outlook"
cask "microsoft-azure-storage-explorer"
cask "onedrive"
cask "slack"
cask "messenger"
cask "spotify"
cask "discord"
