brew "gcc"
brew "zsh"
brew "stow"
brew "oh-my-posh"
brew "tmux"
brew "neovim"
brew "lazygit"
brew "unzip"
brew "ripgrep"
brew "jq"
brew "make"
brew "just"
brew "docker"
brew "libpq"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "vscode-langservers-extracted"
brew "uv"
brew "fnm"
brew "pnpm"
brew "go"
brew "rustup"
brew "azure-cli"
brew "azcopy"

tap "oven-sh/bun"
brew "oven-sh/bun/bun"

brew "nixfmt"
brew "lua-language-server"
brew "stylua"
brew "pyright"
brew "ruff"
brew "prettier"
brew "eslint"
brew "typescript"
brew "typescript-language-server"
brew "gopls"

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

cask "docker-desktop"
cask "pgadmin4"
cask "ghostty"
cask "keepingyouawake"
cask "claude-code"
cask "fork"
cask "visual-studio-code"
cask "microsoft-edge"
cask "microsoft-teams"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-outlook"
cask "microsoft-azure-storage-explorer"
cask "onedrive"
cask "slack"
cask "spotify"
cask "discord"
